app/controllers/rides_controller.rb

def destroy
	@rides = Rides.find(params[:id])
	@rides.destroy
---
SELECT  "rides".* FROM "rides"  WHERE "rides"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "rides" WHERE "rides"."id" = ?  [["id", 1]]

def create
@rides = Rides.new(rides_params)
@rides.save
---
INSERT INTO "rides" ("Dropoff", "Passengers", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Dropoff", "Riverview Apartments"], ["Passengers", "+1 Passenger"], ["created_at", "2014-12-06 03:58:39.141239"], ["name", "hello"], ["updated_at", "2014-12-06 03:58:39.141239"]]

def show
@rides = Rides.find(params[:id])
---
SELECT  "rides".* FROM "rides"  WHERE "rides"."id" = ? LIMIT 1  [["id", 3]]